IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
Concrete result base class

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase.#ctor
Constructor

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase.InternalFores
internal forces used for calculation

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase.NonConformities
Returns nonconformity in section

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase.Result
check result passed/failed

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase.CheckValue
calculated limited value, calculated as strain to limit strain

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase.LimitCheckValue
limit check value for result check

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase.Check
settings of check type